report/sysbench/MySQL_PG_test/oltp_update_index.master_mysql_200.txt
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 200
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 200 tps: 15241.04 qps: 15241.04 (r/w/o: 0.00/15241.04/0.00) lat (ms,99%): 137.35 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 200 tps: 16790.31 qps: 16790.31 (r/w/o: 0.00/16790.31/0.00) lat (ms,99%): 114.72 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 200 tps: 15885.01 qps: 15885.01 (r/w/o: 0.00/15885.01/0.00) lat (ms,99%): 80.03 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 200 tps: 14336.92 qps: 14336.92 (r/w/o: 0.00/14336.92/0.00) lat (ms,99%): 101.13 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 200 tps: 15475.59 qps: 15475.59 (r/w/o: 0.00/15475.59/0.00) lat (ms,99%): 90.78 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 200 tps: 15354.00 qps: 15354.00 (r/w/o: 0.00/15354.00/0.00) lat (ms,99%): 99.33 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 200 tps: 15161.19 qps: 15161.19 (r/w/o: 0.00/15161.19/0.00) lat (ms,99%): 134.90 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 200 tps: 15920.79 qps: 15920.79 (r/w/o: 0.00/15920.79/0.00) lat (ms,99%): 134.90 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 200 tps: 15611.46 qps: 15611.46 (r/w/o: 0.00/15611.46/0.00) lat (ms,99%): 147.61 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 200 tps: 16278.26 qps: 16278.26 (r/w/o: 0.00/16278.26/0.00) lat (ms,99%): 108.68 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 200 tps: 16014.21 qps: 16014.21 (r/w/o: 0.00/16014.21/0.00) lat (ms,99%): 74.46 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 200 tps: 15680.35 qps: 15680.35 (r/w/o: 0.00/15680.35/0.00) lat (ms,99%): 127.81 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 200 tps: 16449.48 qps: 16449.48 (r/w/o: 0.00/16449.48/0.00) lat (ms,99%): 155.80 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 200 tps: 14829.53 qps: 14829.53 (r/w/o: 0.00/14829.53/0.00) lat (ms,99%): 101.13 err/s: 0.00 reconn/s: 0.00
[ 75s ] thds: 200 tps: 15958.18 qps: 15958.18 (r/w/o: 0.00/15958.18/0.00) lat (ms,99%): 86.00 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 200 tps: 16822.47 qps: 16822.47 (r/w/o: 0.00/16822.47/0.00) lat (ms,99%): 106.75 err/s: 0.00 reconn/s: 0.00
[ 85s ] thds: 200 tps: 15282.27 qps: 15282.27 (r/w/o: 0.00/15282.27/0.00) lat (ms,99%): 118.92 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 200 tps: 14766.60 qps: 14766.60 (r/w/o: 0.00/14766.60/0.00) lat (ms,99%): 101.13 err/s: 0.00 reconn/s: 0.00
[ 95s ] thds: 200 tps: 16629.25 qps: 16629.25 (r/w/o: 0.00/16629.25/0.00) lat (ms,99%): 86.00 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 200 tps: 16136.33 qps: 16136.33 (r/w/o: 0.00/16136.33/0.00) lat (ms,99%): 89.16 err/s: 0.00 reconn/s: 0.00
[ 105s ] thds: 200 tps: 15295.62 qps: 15295.62 (r/w/o: 0.00/15295.62/0.00) lat (ms,99%): 101.13 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 200 tps: 15868.23 qps: 15868.23 (r/w/o: 0.00/15868.23/0.00) lat (ms,99%): 90.78 err/s: 0.00 reconn/s: 0.00
[ 115s ] thds: 200 tps: 16216.42 qps: 16216.42 (r/w/o: 0.00/16216.42/0.00) lat (ms,99%): 104.84 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 200 tps: 15972.83 qps: 15972.83 (r/w/o: 0.00/15972.83/0.00) lat (ms,99%): 110.66 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           1890119
        other:                           0
        total:                           1890119
    transactions:                        1890119 (15733.47 per sec.)
    queries:                             1890119 (15733.47 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.1323s
    total number of events:              1890119

Latency (ms):
         min:                                    1.37
         avg:                                   12.70
         max:                                  721.29
         99th percentile:                      110.66
         sum:                             24007034.09

Threads fairness:
    events (avg/stddev):           9450.5950/118.57
    execution time (avg/stddev):   120.0352/0.04